xueliu/nRF52/nrf5_iot_sdk_3288530/examples/iot/coap/ipv6/server_block/main.c
    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
}
#endif // COMMISSIONING_ENABLED


static void ip_app_handler(iot_interface_t * p_interface, ipv6_event_t * p_event)
{
    uint32_t    err_code;
    ipv6_addr_t src_addr;

    APPL_LOG("[APPL]: Got IP Application Handler Event on interface 0x%p\r\n", p_interface);

    switch(p_event->event_id)
    {
        case IPV6_EVT_INTERFACE_ADD:
#ifdef COMMISSIONING_ENABLED
            commissioning_joining_mode_timer_ctrl(JOINING_MODE_TIMER_STOP_RESET);
#endif // COMMISSIONING_ENABLED
            APPL_LOG("[APPL]: New interface added!\r\n");
            m_display_state = LEDS_IPV6_IF_UP;

            APPL_LOG("[APPL]: Sending Router Solicitation to all routers!\r\n");

            // Create Link Local addresses
            IPV6_CREATE_LINK_LOCAL_FROM_EUI64(&src_addr, p_interface->local_addr.identifier);

            // Delay first solicitation due to possible restriction on other side.
            nrf_delay_ms(APP_RTR_SOLICITATION_DELAY);

            // Send Router Solicitation to all routers.
            err_code = icmp6_rs_send(p_interface,
                                     &src_addr,
                                     &local_routers_multicast_addr);
            APP_ERROR_CHECK(err_code);
            break;

        case IPV6_EVT_INTERFACE_DELETE:
#ifdef COMMISSIONING_ENABLED
            commissioning_joining_mode_timer_ctrl(JOINING_MODE_TIMER_START);
#endif // COMMISSIONING_ENABLED
            APPL_LOG("[APPL]: Interface removed!\r\n");
            m_display_state = LEDS_IPV6_IF_DOWN;
            break;

        case IPV6_EVT_INTERFACE_RX_DATA:
            APPL_LOG("[APPL]: Got unsupported protocol data!\r\n");
            break;

        default:
            //Unknown event. Should not happen.
            break;
    }
}


void well_known_core_callback(coap_resource_t * p_resource, coap_message_t * p_request)
{
    coap_message_conf_t response_config;
    memset(&response_config, 0x00, sizeof(coap_message_conf_t));

    if (p_request->header.type == COAP_TYPE_NON)
    {
        response_config.type = COAP_TYPE_NON;
    }
    else if (p_request->header.type == COAP_TYPE_CON)
    {
        response_config.type = COAP_TYPE_ACK;
    }

    // PIGGY BACKED RESPONSE
    response_config.code = COAP_CODE_205_CONTENT;
    // Copy message ID.
    response_config.id = p_request->header.id;
    // Set local port number to use.
    response_config.port.port_number = LOCAL_PORT_NUM;
    // Copy token.
    memcpy(&response_config.token[0], &p_request->token[0], p_request->header.token_len);
    // Copy token length.
    response_config.token_len = p_request->header.token_len;

    coap_message_t * p_response;
    uint32_t err_code = coap_message_new(&p_response, &response_config);
    APP_ERROR_CHECK(err_code);

    err_code = coap_message_remote_addr_set(p_response, &p_request->remote);
    APP_ERROR_CHECK(err_code);

    memcpy(&p_response->remote, &p_request->remote, sizeof(coap_remote_t));

    err_code = coap_message_opt_uint_add(p_response, COAP_OPT_CONTENT_FORMAT, \
                                         COAP_CT_APP_LINK_FORMAT);
    APP_ERROR_CHECK(err_code);

    err_code = coap_message_payload_set(p_response, m_well_known_core, \
                                        strlen((char *)m_well_known_core));
    APP_ERROR_CHECK(err_code);

    uint32_t msg_handle;
    err_code = coap_message_send(&msg_handle, p_response);
    APP_ERROR_CHECK(err_code);

    err_code = coap_message_delete(p_response);
    APP_ERROR_CHECK(err_code);
}


static void large_resource_callback(coap_resource_t * p_resource, coap_message_t * p_request)
{
    coap_message_conf_t response_config;
    memset(&response_config, 0x00, sizeof(coap_message_conf_t));

    if (p_request->header.type == COAP_TYPE_NON)
    {
        response_config.type = COAP_TYPE_NON;
    }
    else if (p_request->header.type == COAP_TYPE_CON)
    {
        response_config.type = COAP_TYPE_ACK;
    }

    response_config.code = COAP_CODE_405_METHOD_NOT_ALLOWED;

    // Copy message ID.
    response_config.id = p_request->header.id;
    // Set local port number to use.
    response_config.port.port_number = LOCAL_PORT_NUM;
    // Copy token.
    memcpy(&response_config.token[0], &p_request->token[0], p_request->header.token_len);
    // Copy token length.
    response_config.token_len = p_request->header.token_len;

    coap_message_t * p_response;
    uint32_t err_code = coap_message_new(&p_response, &response_config);
    APP_ERROR_CHECK(err_code);

    err_code = coap_message_remote_addr_set(p_response, &p_request->remote);
    APP_ERROR_CHECK(err_code);

    // Handle request.
    switch (p_request->header.code)
    {
        case COAP_CODE_PUT:
            {
                uint8_t option_index;
                if (coap_message_opt_index_get(&option_index, p_request, COAP_OPT_BLOCK1) == NRF_SUCCESS)
                {
                    // Locate the option by index.
                    coap_option_t * p_block1_opt = &p_request->options[option_index];

                    // Decode option value into a uint32_t.
                    uint32_t block1_opt_value_raw;
                    err_code = coap_opt_uint_decode(&block1_opt_value_raw,
                                                    p_block1_opt->length,
                                                    p_block1_opt->p_data);
                    APP_ERROR_CHECK(err_code);

                    // Decode uint32_t value into block1 option structure.
                    coap_block_opt_block1_t block1_request;
                    err_code = coap_block_opt_block1_decode(&block1_request, block1_opt_value_raw);

                    if (err_code == (NRF_ERROR_INVALID_DATA | IOT_COAP_ERR_BASE))
                    {
                        // value 7 is used for size indicator.
                        // Reply with 4.00 Bad Request.
                        p_response->header.code = COAP_CODE_400_BAD_REQUEST;
                    }
                    else if (err_code != NRF_SUCCESS)
                    {
                        // If error code is not expected, raise it.
                        APP_ERROR_CHECK(err_code);
                    }
                    else
                    {
                        static char msg_buffer[COAP_PREFERRED_BLOCK_SIZE + 1];

                        strncpy((char *)msg_buffer, (char *)p_request->p_payload, p_request->payload_len);
                        msg_buffer[p_request->payload_len] = '\0';
                        APPL_LOG("[APPL][CoAP-Block]: block %3lu : %s\r\n", block1_request.number, msg_buffer);

                        // Set up block1 response option values.
                        coap_block_opt_block1_t block1_response =
                        {
                            .number = block1_request.number,
                            .more   = block1_request.more,
                            .size   = block1_request.size
                        };

                        // Encode the block1 option into a uint32_t.
                        uint32_t block1_response_encoded;
                        err_code = coap_block_opt_block1_encode(&block1_response_encoded, &block1_response);

